app/Controllers/Cajas.php

    public function gridCierresCaja() {

        $data = $this->acl();

        if ($data['logged'] == 1 && $this->session->administracion == 1) {
            //  echo '<pre>'.var_export('inicio', true).'</pre>';exit;

            $data['session'] = $this->session;
            $data['sistema'] = $this->datosSistemaModel->findAll();

            $data['tipos'] = $this->tipoDocumentoModel->findAll();

            $data['cierres'] = $this->cierreCajaModel->select('cierres_caja.id as id,monto_inicial,monto_final,nombre,fecha_inicio,fecha_cierre,total_ventas,cierres_caja.estado as estado,caja')
                            ->join('cajas','cierres_caja.idcaja=cajas.id','left')
                            ->join('usuarios','cierres_caja.idusuario=usuarios.id','left')
                            ->orderBy('fecha_inicio', 'asc')->findAll();
---
SELECT *
FROM `datossistema`
SELECT *
FROM `tipo_documento`
SELECT `cierres_caja`.`id` as `id`, `monto_inicial`, `monto_final`, `nombre`, `fecha_inicio`, `fecha_cierre`, `total_ventas`, `cierres_caja`.`estado` as `estado`, `caja`
FROM `cierres_caja`
LEFT JOIN `cajas` ON `cierres_caja`.`idcaja`=`cajas`.`id`
LEFT JOIN `usuarios` ON `cierres_caja`.`idusuario`=`usuarios`.`id`
ORDER BY `fecha_inicio` ASC