app/Models/UsuarioModel.php

SELECT `logged`
FROM `usuarios`
WHERE `id` = '4'
---
    function _getLogStatus($id){
        $result = NULL;
        $builder = $this->db->table('usuarios');
        $builder->select('logged')->where('id', $id);
        $query = $builder->get();